{"101000001": 0, "000000000": 1, "001000001": 2, "100000001": 3, "011000001": 4, "000000001": 5, "010000000": 6, "011000000": 7, "101000010": 8, "100000000": 9, "001010000": 10, "000010000": 11, "001000000": 12, "111000000": 13, "101000000": 14, "000100000": 15, "010000001": 16, "100000010": 17, "011100000": 18, "110000000": 19, "100000100": 20, "100010000": 21, "100001000": 22, "001000101": 23, "000000101": 24, "000000100": 25, "111000010": 26, "011010000": 27, "001100000": 28, "001001000": 29, "010000010": 30, "000010001": 31, "110010000": 32, "100100000": 33, "101100000": 34, "110000001": 35, "111000001": 36, "100100001": 37, "100010001": 38, "001010001": 39, "100001001": 40, "001000010": 41, "011000010": 42, "101001000": 43, "010100000": 44, "010010000": 45, "011000100": 46, "011001000": 47, "101001100": 48, "110100000": 49, "111100000": 50, "110000010": 51, "100001100": 52, "001000100": 53, "000010100": 54, "001001100": 55, "000001000": 56, "100010100": 57, "000001001": 58, "010000100": 59, "111001000": 60, "101010000": 61, "101000100": 62, "110000100": 63, "010001000": 64, "000000010": 65, "001010100": 66, "000011000": 67, "001100101": 68, "111000100": 69, "001000110": 70, "001100010": 71, "000000110": 72, "100000011": 73, "000001100": 74, "000100001": 75, "001100110": 76, "111010000": 77, "000100100": 78, "001100001": 79, "100000101": 80, "101100001": 81, "100100010": 82, "000011001": 83, "100000110": 84, "111010001": 85, "000101000": 86, "110001000": 87, "000000011": 88, "001100100": 89, "001001001": 90, "010010100": 91, "100010011": 92, "010000011": 93, "101100010": 94, "011000101": 95, "111100001": 96, "011001001": 97, "101000101": 98, "001101000": 99, "011100100": 100, "111100010": 101, "101000011": 102, "011010001": 103, "001011000": 104, "100011000": 105, "011000110": 106, "100010010": 107, "110000011": 108, "101100101": 109, "101010001": 110, "001110000": 111, "110001001": 112, "110010001": 113, "100110000": 114, "000100010": 115, "011100010": 116, "000100101": 117, "101001001": 118, "010010001": 119, "001010010": 120, "011100001": 121, "111001001": 122, "101010100": 123, "010001001": 124, "000110000": 125, "101100011": 126, "001000011": 127, "111000011": 128, "101010010": 129, "100100100": 130, "101000110": 131, "110000110": 132, "010100100": 133, "101011000": 134, "010000101": 135, "000010010": 136, "010100001": 137, "011000011": 138, "010011000": 139, "011101000": 140, "110000111": 141, "001101100": 142, "011010101": 143, "001100011": 144, "100001101": 145, "010101000": 146, "010100010": 147, "010010101": 148, "111010101": 149, "100011010": 150, "110011001": 151}